VPro/src/Catalogs/Companies/Companies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Companies</name>
  <predefined>
    <items>
      <name>MainCompany</name>
      <description>Doanh nghiệp chúng ta</description>
    </items>
  </predefined>
  <attributes>
    <name>BankAccountByDefault</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessCalendar</name>
    <type>
      <types>CatalogRef.Calendars</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultVATRate</name>
    <type>
      <types>CatalogRef.VATRates</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FileFacsimilePrinting</name>
    <type>
      <types>CatalogRef.CompaniesAttachedFiles</types>
    </type>
  </attributes>
  <attributes>
    <name>IncludeVATInPrice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntityIndividual</name>
    <type>
      <types>EnumRef.CounterpartyKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>LogoFile</name>
    <type>
      <types>CatalogRef.CompaniesAttachedFiles</types>
    </type>
  </attributes>
  <attributes>
    <name>PettyCashByDefault</name>
    <type>
      <types>CatalogRef.PettyCashes</types>
    </type>
  </attributes>
  <attributes>
    <name>Prefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationCountry</name>
    <type>
      <types>CatalogRef.WorldCountries</types>
    </type>
  </attributes>
  <attributes>
    <name>TIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LegalForm</name>
    <type>
      <types>CatalogRef.LegalForms</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Region</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EmailAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ActivityTypes</name>
    <attributes>
      <name>ActivityType</name>
      <type>
        <types>CatalogRef.ActivityTypes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Catalogs/Counterparties/Counterparties.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Counterparties</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccountByDefault</name>
    <comment>Bank account by default</comment>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>DoOperationsByContracts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DoOperationsByDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DoOperationsByOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackPaymentsByBills</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntityIndividual</name>
    <type>
      <types>EnumRef.CounterpartyKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessGroup</name>
    <type>
      <types>CatalogRef.CounterpartiesAccessGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractByDefault</name>
    <comment>Default counterparty contract</comment>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ContactPerson</name>
    <type>
      <types>CatalogRef.ContactPersons</types>
    </type>
  </attributes>
  <attributes>
    <name>BasicInformation</name>
    <comment>It used to search in the list</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAdvancesGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountCustomerSettlements</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountVendorSettlements</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAdvancesGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationCountry</name>
    <type>
      <types>CatalogRef.WorldCountries</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAcquisitionChannel</name>
    <type>
      <types>CatalogRef.CustomerAcquisitionChannels</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Supplier</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OtherRelationship</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DateOfBirth</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.IndividualGender</types>
    </type>
  </attributes>
  <attributes>
    <name>VATNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LegalForm</name>
    <type>
      <types>CatalogRef.LegalForms</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Region</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EmailAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Tags</name>
    <attributes>
      <name>Tag</name>
      <type>
        <types>CatalogRef.Tags</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ActivityTypes</name>
    <attributes>
      <name>ActivityType</name>
      <type>
        <types>CatalogRef.ActivityTypes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/CommonModules/PrintDocumentsCMClient/Module.bsl
#Region InternalProceduresAndFunctions

Procedure UpdatePrintAttributesValues(CurrentObject, ChangedAttributes) Export
	
	If CurrentObject.ReadOnly Then
		
		Return;
		
	EndIf;
	
	For Each StructureItem In ChangedAttributes Do
		
		CurrentObject.Object[StructureItem.Key] = StructureItem.Value;
		
		If Not CurrentObject.Modified Then
			
			CurrentObject.Modified = True;
			
		EndIf;
		
	EndDo;
	
EndProcedure

Function SuggestFillCompanyAttributes(PrintParameters) Export
	
	OpenAttributesFillingFormForPrint(PrintParameters, "ManagerSignature,ChiefAccountantSignature,TIN,KPP,BankAccountByDefault,LogoFile,LegAddress");
	
EndFunction

Function OfferFillCompanyAttributesWithFacsimileSignature(PrintParameters) Export
	
	OpenAttributesFillingFormForPrint(PrintParameters, "ManagerSignature,ChiefAccountantSignature,TIN,KPP,BankAccountByDefault,LogoFile,LegAddress,FileFacsimilePrinting");
	
EndFunction

Procedure OpenAttributesFillingFormForPrint(PrintParameters, AttributesNamesToFill)
	
	FormParameters = New Structure;
	FormParameters.Insert("PrintManagerName", PrintParameters.PrintManager);
	FormParameters.Insert("TemplateNames", PrintParameters.ID);
	FormParameters.Insert("CommandParameter", PrintParameters.PrintObjects);
	FormParameters.Insert("AttributesNamesToFill", AttributesNamesToFill);
	FormParameters.Insert("PrintParameters", New Structure);
	For Each KeyAndValue In PrintParameters Do
		If TypeOf(KeyAndValue.Value) = Type("ClientApplicationForm") Then
			Continue;
		EndIf;
		FormParameters.PrintParameters.Insert(KeyAndValue.Key, KeyAndValue.Value);
	EndDo;
	
	FormParameters.Insert(
	"Key",
	SmallBusinessServer.CompanyFromCommandParameter(FormParameters.CommandParameter));
	
	If ValueIsFilled(FormParameters.Key) Then
		
		AttributesFillingFormForPrinting = OpenForm(
		"Catalog.Companies.Form.AttributesFillingFormForPrinting",
		FormParameters,
		String(New UUID));
		
		If AttributesFillingFormForPrinting <> Undefined Then
			Return;
		EndIf;
		
	EndIf;
	
	PrintManagementClient.ExecutePrintCommand(
	FormParameters.PrintManagerName,
	FormParameters.TemplateNames,
	FormParameters.CommandParameter,
	PrintParameters.Form,
	FormParameters);
	
EndProcedure

Procedure PrintPriceTagsAndLabelsPrintingCommandOnLabelPrinter(PrintParameters) Export
	
	DataProcessor = PrintParameters.PrintObjects[0];
	
	If DataProcessor.Goods.FindRows(New Structure("Selected", True)).Count() = 0 Then
		ShowMessageBox(, NStr("en='Не выбрано ни одного товара';ru='Не выбрано ни одного товара';vi='Chưa chọn hàng hóa nào'"));
		Return;
	EndIf;
	
	If PrintParameters.Property("FormID") Then
		FormID = PrintParameters.FormID;
	Else
		FormID = PrintParameters.Form.UUID;
	EndIf;
	
	DataForLabelsPrinter = CompanyManagementServerCall.PrepareLabelPrinterPriceTagsAndLabelDataStructure(DataProcessor, PrintParameters.PrintManager, PrintParameters.CurrentSize);
	
	If DataForLabelsPrinter.Count() > 0 Then
		
		For Each CurTemplate In DataForLabelsPrinter Do
			
			PrintCompletion = New NotifyDescription("ProcessPrintPriceTagsAndLabelsOnPrinterLabelsCompletion", PrintDocumentsCMClient, CurTemplate);
			
			EquipmentManagerClient.StartLabelsPrinting(PrintCompletion, FormID, CurTemplate.XML, CurTemplate.Labels);
			
		EndDo;
		
	EndIf;
	
EndProcedure

Procedure ProcessPrintPriceTagsAndLabelsOnPrinterLabelsCompletion(ExecutionResult, Parameters) Export
	
	If ExecutionResult.Result Then
		
		Return;
		
	Else
		
		MessageText = NStr("en='При печати произошла ошибка."
"Дополнительное описание:"
"%AdditionalDetails%';ru='При печати произошла ошибка."
"Дополнительное описание:"
"%AdditionalDetails%';vi='Đã xảy ra lỗi khi in."
"Mô tả bổ sung:"
"%AdditionalDetails%'"
		);
		MessageText = StrReplace(
			MessageText,
			"%AdditionalDetails%",
			ExecutionResult.ErrorDescription
		);
		
		CommonUseClientServer.MessageToUser(MessageText);
		
	EndIf;
	
EndProcedure

#Region ClientPrintMethods

Function ContactInformationPrinting(PrintParameters) Export
	
	FormParameters = New Structure;
	FormParameters.Insert("CounterpartiesInitialValue", PrintParameters.PrintObjects);
	
	If PrintParameters.PrintObjects.Count() > 0 Then
		UniqueKey = PrintParameters.PrintObjects[0];
	Else
		UniqueKey = False;
	EndIf;
	
	OpenForm("Catalog.Counterparties.Form.ContactInformationForm", FormParameters, , UniqueKey);
	
EndFunction

Function EnvelopePrint(CommandDetails) Export
	
	FormParameters = New Structure;
	FormParameters.Insert("PrintObjects", CommandDetails.PrintObjects);
	
	OpenForm("DataProcessor.EnvelopesPrint.Form", FormParameters);
	
EndFunction

#EndRegion

#Region OnChangeFormAttributes

Procedure OnChangeCounterpartyContract(ContractAfterChange, PrintBasisRef, StampBase, AdditionalParameters = Undefined) Export
	
	FillPrintBasisByContract = True;
	AddWordContractInPrintBasisContractPresentation = True;
	If TypeOf(AdditionalParameters) = Type("Structure") Then
		
		ConstantValue = Undefined;
		If AdditionalParameters.Property("PrintBasisInvoiceForPayment", ConstantValue) Then
			
			FillPrintBasisByContract = (ConstantValue = PredefinedValue("Enum.PrintBasisInitialFillingMethod.CounterpartyContract"));
			
		EndIf;
		
		If AdditionalParameters.Property("PrintBasisCustomerOrder", ConstantValue) Then
			
			FillPrintBasisByContract = (ConstantValue = PredefinedValue("Enum.PrintBasisInitialFillingMethod.CounterpartyContract"));
			
		EndIf;
		
		AdditionalParameters.Property("AddWordContractInPrintBasisContractPresentation", AddWordContractInPrintBasisContractPresentation);
		AddWordContractInPrintBasisContractPresentation = (AddWordContractInPrintBasisContractPresentation = Undefined Or AddWordContractInPrintBasisContractPresentation = True);
		
	EndIf;
	
	If FillPrintBasisByContract Then
		
		If Not ValueIsFilled(ContractAfterChange) Then
			
			If Not ValueIsFilled(PrintBasisRef)
				Or TypeOf(PrintBasisRef) = Type("CatalogRef.CounterpartyContracts") Then
				
				PrintBasisRef = Undefined;
				StampBase = "";
				
			EndIf;
			
		ElsIf ValueIsFilled(ContractAfterChange) Then
			
			If Not ValueIsFilled(PrintBasisRef)
				Or TypeOf(PrintBasisRef) = Type("CatalogRef.CounterpartyContracts") Then
			
				PrintBasisRef = ContractAfterChange;
				
				PresentationTitle = "";
				If AddWordContractInPrintBasisContractPresentation Then
					
					PresentationTitle = NStr("en='Договор: ';ru='Договор: ';vi='Hợp đồng:'");
					
				EndIf;
				
				StampBase = PresentationTitle + String(ContractAfterChange);
			
			EndIf;
			
		EndIf;
		
	EndIf;
	
EndProcedure

#EndRegion

#EndRegion
